хочемо_їхати = true
зупинки = ["Карамельний провулок", "Східні ковдобини", "Вужгород", "Новий Яворівськ"]

while хочемо_їхати
  print "Агов! Куди прямуєш?: "
  пункт_призначення = gets.chomp

  if зупинки.include? пункт_призначення
    puts "Я знаю, як доїхати до #{пункт_призначення}! Ось список станцій по дорозі:"
    зупинки.each do |зупинка|
      puts зупинка
      break if зупинка == пункт_призначення
    end
  else
    puts "Вибачте, я не зупиняюся на тій станції. Іншим разом!"
    хочемо_їхати = false
  end
end